{
	"projects": [
		{
			"title": "Portfolio",
			"colour": "red",
			"tags": ["Frontend Web", "ReactJS", "NodeJS", "ExpressJS"],
			"url": "https://trentshailer.com",
			"git": "https://github.com/TrentShailer/Portfolio",
			"description": "<div>A portfolio to display some of my programming projects.<br><br>My portfolio is a frontend website built on top of ReactJS using custom components.  My portfolio dynamically generates the project panels by reading a custom json file hosted through one of my github repos, this allows for easy addition and modification of projects at any time without needing to rebuild the project.</div>"
		},
		{
			"title": "Cloud Storage",
			"colour": "blue",
			"tags": ["Full-Stack Web", "ReactJS", "NodeJS", "PostgreSQL"],
			"url": "https://cloud.trentshailer.com",
			"git": "https://github.com/TrentShailer/Cloud-Storage",
			"img": "https://github.com/TrentShailer/Static-Files/blob/master/Portfolio/Images/Cloud/Images.md",
			"description": "<div>This project is a full-stack project that is similar to the likes of Dropbox or Google Drive.  It features a frontend made with React, React Suite, and react router, a backend built with NodeJS and ExpressJS, and a database running on PostgreSQL.  It features, file upload, download, sharing, a fully fledged ExpressJS backend to manage all web requests and database queries, using recursion to process all your files and folders, secure password encryption with Argon2id hashing, and SMTP server usage for confirmation emails. </div>"
		},
		{
			"title": "Weather Station",
			"colour": "green",
			"tags": ["RaspberryPi", "ReactJS", "NodeJS", "Python"],
			"git": "https://github.com/TrentShailer/Weather-Station",
			"img": "https://github.com/TrentShailer/Static-Files/blob/master/Portfolio/Images/Weather/Images.md",
			"description": "<div> This project is everything I programmed for my at home weather station, it is comprised of a python script running on the Pi, a frontend made with ReactJS and MaterialUI, and a backend using NodeJS and ExpressJS.  <br/>The weather station collects temperature, humidity, air pressure, UV-Index, wind speed, and rainfall which is all send to the server every 5 minutes which is then processed and displayed on the frontend along with stored for frontend graphing of all data collected. </div>"
		},
		{
			"title": "Vex Modules",
			"colour": "orange",
			"tags": ["C++", "Vex"],
			"git": "https://github.com/TrentShailer/Vex-Modules",
			"description": "<div> This project is a collection of modules I made for the <a href='https://www.freyberg.ac.nz' target='_blank' rel='noreferrer'>Freyberg</a> High School's <a href='https://www.vexrobotics.com/v5' target='_blank' rel='noreferrer'>Vex</a> robotics team.<br/> This includes image displaying via a custom implementation of run length encoding compression, smooth motor control, smooth drivetrain control, auton selection, mechanum drivetrain, and pathfinding for autonomous all written in C++ with the Vex v5 API. </div>"
		},
		{
			"title": "Notifier App",
			"colour": "purple",
			"tags": ["React Native App", "Expo"],
			"git": "https://github.com/TrentShailer/Notifier-App",
			"img": "https://github.com/TrentShailer/Static-Files/blob/master/Portfolio/Images/Notifier/Images.md",
			"description": "<div>Notifier is an app to receives notifications that you can send out programmatically by sending a POST request to the webserver.  This is a react native app built with expo.</div>"
		},
		{
			"title": "Notifier Webserver",
			"colour": "deepPurple",
			"tags": ["Backend Web", "NodeJS", "PostgreSQL", "ExpressJS"],
			"git": "https://github.com/TrentShailer/Notifier-Webserver",
			"description": "<div>This is the webserver to allow notifier app to work, and works with a postgreSQL database running in a docker container.</div>"
		},
		{
			"title": "URL-Shortener",
			"colour": "teal",
			"tags": ["ReactJS", "GraphQL", "ExpressJS", "NodeJS"],
			"url": "https://url.trentshailer.com",
			"git": "https://github.com/TrentShailer/URL-Shortener",
			"description": "<div>This is a project I wanted to create to be able to shorten long urls like when sharing a google drive file.  It's build with a reactJS front end using my own component library.  The backend is running expressJS and graphQL, this lets be query the backend through one endpoint for any data rather than using one endpoint per query.</div>"
		}
	]
}
